PHYSICAL-ROUTER#show ip route vrf VRF-1 | b Gateway
Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
C        1.1.1.1 is directly connected, Loopback1000
      10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
C        10.20.1.0/24 is directly connected, Ethernet0/0.2001
L        10.20.1.1/32 is directly connected, Ethernet0/0.2001
C        10.20.2.0/24 is directly connected, Ethernet0/0.2002
L        10.20.2.1/32 is directly connected, Ethernet0/0.2002

PHYSICAL-ROUTER#show ip route vrf VRF-2 | b Gateway
Gateway of last resort is not set

      2.0.0.0/32 is subnetted, 1 subnets
C        2.2.2.2 is directly connected, Loopback2000
      10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
C        10.20.1.0/24 is directly connected, Ethernet0/1.2001
L        10.20.1.2/32 is directly connected, Ethernet0/1.2001
C        10.20.3.0/24 is directly connected, Ethernet0/0.2003
L        10.20.3.2/32 is directly connected, Ethernet0/0.2003

PHYSICAL-ROUTER#show ip route vrf VRF-3 | b Gateway
Gateway of last resort is not set

      3.0.0.0/32 is subnetted, 1 subnets
C        3.3.3.3 is directly connected, Loopback3000
      10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
C        10.20.2.0/24 is directly connected, Ethernet0/1.2002
L        10.20.2.3/32 is directly connected, Ethernet0/1.2002
C        10.20.3.0/24 is directly connected, Ethernet0/1.2003
L        10.20.3.3/32 is directly connected, Ethernet0/1.2003
PHYSICAL-ROUTER#

======================================================================
PHYSICAL-ROUTER#show int description | i up
Et0/0                          up             up       "Physical connect to Switch"
Et0/0.2001                     up             up       "R1->R2"
Et0/0.2002                     up             up       "R1->R3"
Et0/0.2003                     up             up       "R2->R3"
Et0/1                          up             up       "Physical connect to Switch"
Et0/1.2001                     up             up       "R2->R1"
Et0/1.2002                     up             up       "R3->R1"
Et0/1.2003                     up             up       "R3->R2"
Lo1000                         up             up       LAN-VRF-1
Lo2000                         up             up       LAN-VRF-2
Lo3000                         up             up       LAN-VRF-3
PHYSICAL-ROUTER#
PHYSICAL-ROUTER#show ip vrf
  Name                             Default RD            Interfaces
  VRF-1                            1:1                   Et0/0.2001
                                                         Et0/0.2002
                                                         Lo1000
  VRF-2                            2:2                   Et0/0.2003
                                                         Et0/1.2001
                                                         Lo2000
  VRF-3                            3:3                   Et0/1.2002
                                                         Et0/1.2003
                                                         Lo3000
======================================================================

---------
R1 -> R2
---------
PHYSICAL-ROUTER#ping vrf VRF-1 10.20.1.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.20.1.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms

---------
R1 -> R3
---------
PHYSICAL-ROUTER#ping vrf VRF-1 10.20.2.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.20.2.3, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms

---------
R2 -> R3
---------
PHYSICAL-ROUTER#ping vrf VRF-2 10.20.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.20.3.3, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
PHYSICAL-ROUTER#

======================================================================

PHYSICAL-ROUTER#show ip route vrf VRF-1 | b Gateway
Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
C        1.1.1.1 is directly connected, Loopback1000
      2.0.0.0/32 is subnetted, 1 subnets
O        2.2.2.2 [110/11] via 10.20.1.2, 00:22:39, Ethernet0/0.2001
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/11] via 10.20.2.3, 00:22:39, Ethernet0/0.2002
      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
C        10.20.1.0/24 is directly connected, Ethernet0/0.2001
L        10.20.1.1/32 is directly connected, Ethernet0/0.2001
C        10.20.2.0/24 is directly connected, Ethernet0/0.2002
L        10.20.2.1/32 is directly connected, Ethernet0/0.2002
O        10.20.3.0/24 [110/20] via 10.20.2.3, 00:22:39, Ethernet0/0.2002
                      [110/20] via 10.20.1.2, 00:22:39, Ethernet0/0.2001

PHYSICAL-ROUTER#show ip route vrf VRF-2 | b Gateway
Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O        1.1.1.1 [110/11] via 10.20.1.1, 00:23:07, Ethernet0/1.2001
      2.0.0.0/32 is subnetted, 1 subnets
C        2.2.2.2 is directly connected, Loopback2000
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/11] via 10.20.3.3, 00:23:07, Ethernet0/0.2003
      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
C        10.20.1.0/24 is directly connected, Ethernet0/1.2001
L        10.20.1.2/32 is directly connected, Ethernet0/1.2001
O        10.20.2.0/24 [110/20] via 10.20.3.3, 00:23:07, Ethernet0/0.2003
                      [110/20] via 10.20.1.1, 00:23:07, Ethernet0/1.2001
C        10.20.3.0/24 is directly connected, Ethernet0/0.2003
L        10.20.3.2/32 is directly connected, Ethernet0/0.2003

PHYSICAL-ROUTER#show ip route vrf VRF-3 | b Gateway
Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O        1.1.1.1 [110/11] via 10.20.2.1, 00:23:21, Ethernet0/1.2002
      2.0.0.0/32 is subnetted, 1 subnets
O        2.2.2.2 [110/11] via 10.20.3.2, 00:23:21, Ethernet0/1.2003
      3.0.0.0/32 is subnetted, 1 subnets
C        3.3.3.3 is directly connected, Loopback3000
      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
O        10.20.1.0/24 [110/20] via 10.20.3.2, 00:23:21, Ethernet0/1.2003
                      [110/20] via 10.20.2.1, 00:23:21, Ethernet0/1.2002
C        10.20.2.0/24 is directly connected, Ethernet0/1.2002
L        10.20.2.3/32 is directly connected, Ethernet0/1.2002
C        10.20.3.0/24 is directly connected, Ethernet0/1.2003
L        10.20.3.3/32 is directly connected, Ethernet0/1.2003

======================

PHYSICAL-ROUTER#show ip route vrf VRF-1 ospf | b Gateway
Gateway of last resort is not set

      2.0.0.0/32 is subnetted, 1 subnets
O        2.2.2.2 [110/11] via 10.20.1.2, 00:23:52, Ethernet0/0.2001
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/11] via 10.20.2.3, 00:23:52, Ethernet0/0.2002
      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
O        10.20.3.0/24 [110/20] via 10.20.2.3, 00:23:52, Ethernet0/0.2002
                      [110/20] via 10.20.1.2, 00:23:52, Ethernet0/0.2001

PHYSICAL-ROUTER#show ip route vrf VRF-2 ospf | b Gateway
Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O        1.1.1.1 [110/11] via 10.20.1.1, 00:24:02, Ethernet0/1.2001
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/11] via 10.20.3.3, 00:24:02, Ethernet0/0.2003
      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
O        10.20.2.0/24 [110/20] via 10.20.3.3, 00:24:02, Ethernet0/0.2003
                      [110/20] via 10.20.1.1, 00:24:02, Ethernet0/1.2001

PHYSICAL-ROUTER#show ip route vrf VRF-3 ospf | b Gateway
Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O        1.1.1.1 [110/11] via 10.20.2.1, 00:24:07, Ethernet0/1.2002
      2.0.0.0/32 is subnetted, 1 subnets
O        2.2.2.2 [110/11] via 10.20.3.2, 00:24:07, Ethernet0/1.2003
      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
O        10.20.1.0/24 [110/20] via 10.20.3.2, 00:24:07, Ethernet0/1.2003
                      [110/20] via 10.20.2.1, 00:24:07, Ethernet0/1.2002
PHYSICAL-ROUTER#

============================================================

[Ping from R2 to R3 LAN Side]

PHYSICAL-ROUTER#ping vrf VRF-2 3.3.3.3 source 2.2.2.2
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/4 ms

[Ping from R1 to R3 LAN Side]

PHYSICAL-ROUTER#ping vrf VRF-1 3.3.3.3 source 1.1.1.1
Packet sent with a source address of 1.1.1.1
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms

============================================================

